#define _CRT_SECURE_NO_WARNINGS 1

#include<stdio.h>
//
//int main()
//{
//	int a = 1 << 4;
//	//0000000000000000000000000000001
//	//0000000000000000000000000010000
//
//	printf("%d\n", a);
//	return 0;
//}
//
//int main()
//{
//	int a = -1;
//	a <<= 4;
//	//10000000000000000000000000000001 - 原码
//	//11111111111111111111111111111110 - 反码
//	//11111111111111111111111111111111 - 补码
//	//11111111111111111111111111110000
//	//11111111111111111111111111101111
//	//10000000000000000000000000010000
//	printf("%d\n", a);
//	return 0;
//}

//
//int main()
//{
//	int a = (-15 >> 1);
//	//1000000000000000000000000001111
//	//算数右移 / 逻辑右移
//	//1111111111111111111111111110000
//	//1111111111111111111111111110001
//	//1111111111111111111111111111000
//	//1111111111111111111111111110111
//	//1000000000000000000000000001000
//	printf("%d\n", a);
//	return 0;
//}

//
//int main()
//{
//	int a = (-1 >> 4);
//	//11111111111111111111111111111111 - -1的补码
//	printf("%d\n", a);
//	return 0;
//}



// & -- 有一个0 则为0
// | -- 有一个1 则为1
// ^ -- 相同为1 不同为0

//int main()
//{
//	int a = 5;
//	int b = 3;
//
//	/*int tmp = a;
//	a = b;
//	b = tmp;*/
//
//	/*a = a + b;
//	b = a - b;
//	a = a - b;*/
//
//	a = a ^ b;
//	//0011
//	//0101
//	//1001 - 16
//	b = a ^ b;
//	//1001
//	//0011
//	//0101 - 5
//	a = a ^ b;
//	//1001
//	//0101
//	//0011 - 3
//	printf("%d %d", a, b);
//	return 0;
//}

//
//int Count(int n)
//{
//	int i = 0;
//	int count = 0;
//	for (i = 0; i < 32; i++)
//	{
//		if (n & (1 << i))
//		{
//			count++;
//		}
//	}
//	return count;
//}
//
//int main()
//{
//	int a = 0;
//	scanf("%d", &a);
//	int i = 0;
//	int count = Count(a);
//	
//	printf("%d\n", count);
//	return 0;
//}


//int main()
//{
//	int a = 0;
//	/*while (scanf("%d", &a) == 1)
//	{
//		printf("%d\n", a);
//	}*/
//
//	/*while (scanf("%d", &a) != EOF)
//	{
//
//	}*/
//
//	while (~scanf("%d", &a))
//	{
//		printf("%d\n", a);
//	}
//	return 0;
//}

// EOF -1
// ~-1 == 0

//int main()
//{
//	int arr[10] = { 0 };
//	int b = sizeof(arr);
//	printf("%d\n", b);
//	return 0;
//}

// 指针 在X86中占4个字节，X64中占8个字节

//数组名什么时候表示一个数组的地址
//&arr
//sizeof(arr)

//void test1(int arr[])
//{
//	printf("%d\n", sizeof(arr));
//}
//
//void test2(char ch[])
//{
//	printf("%d\n", sizeof(ch));
//}
//
//int main()
//{
//	int arr[10] = { 0 };
//	char ch[10] = { 0 };
//	printf("%d\n", sizeof(arr));
//	printf("%d\n", sizeof(ch));
//	test1(arr);
//	test2(ch);
//	return 0;
//}


// && 左边为0，右边不再计算
// || 左边为1，右边不再计算

//
//#include <stdio.h>
//int main()
//{
//	int a, b, c;
//	a = 5;
//	c = ++a;
//	//6    6
//	b = ++c, c++, ++a, a++;//7
//	//7,8,7, b=a,a=a+1
//	b += a++ + c;
//	//7+ 8 +8 =23 ,9
//	printf("a = %d b = %d c = %d\n:", a, b, c);
//		//9 23 8
//	return 0;
//}


//int main()
//{
//	int a = 5;
//	int b = 3;
//
//	a = a + b;
//	b = a - b;
//	a = a - b;
//	printf("%d %d", a, b);
//	return 0;
//}

//-15
//10000000000000000000000000001111
//11111111111111111111111111110000
//11111111111111111111111111110001




//int main()
//{
//	int n = 0;
//	scanf("%d", &n);
//	int i = 0;
//
//	int arr1[16] = { 0 };
//	int arr2[16] = { 0 };
//
//	for (i = 0; i < 32; i++)
//	{
//		if (i % 2 == 0)
//		{
//			//0 2 4 6 8 ...
//			//0 1 2 3 4 ...
//			arr1[i / 2] = (n & (1 << i) == 0 ? 0 : 1);
//		}
//		
//		else if (i % 2 == 1)
//		{
//			if (i < 2)
//				//1 --> 0
//				arr2[i - 1] = (n & (1 << i) == 0 ? 0 : 1);
//			else
//				//3 5 7 9 ... 31
//				//1 2 3 4 ... 15
//				arr2[i / 2] = (n & (1 << i) == 0 ? 0 : 1);
//		}
//		
//	}
//	printf("奇数位:> ");
//	for (i = 0; i < 16; i++)
//		printf("%d ", arr1[i]);
//	printf("\n");
//
//	printf("偶数位:> ");
//	for (i = 0; i < 16; i++)
//		printf("%d ", arr2[i]);
//	printf("\n");
//	return 0;
//}