#define _CRT_SECURE_NO_WARNINGS 1

#include<stdio.h>

//int main()
//{
//	int arr[10] = { 0,1,2,3,4,5,6,7,8,9 };
//	float arr2[3] = { 3.1,4.5,6.6 };
//	//数组类型 为 数组中存放元素的类型
//
//
//	return 0;
//}


//
//int main()
//{
//	/*int n = 0;
//	int arr[n];*/
//	//在C99标准下 变长数组 ，变长数组不能进行初始化
//	//VS2019 VS2022不支持C99中的变长数组
//	//局部的变量或数组，存放在栈区，如果不初始化，默认是随机值
//	return 0;
//}


int main()
{
	int arr1[4] = { 1,2,3,4 };//完全初始化
	int arr2[4] = { 1,2 };//不完全初始化，未初始化的数组元素默认为0
	int arr3[4] = { 0 };//不完全初始化，未初始化的数组元素默认为0
	int arr4[] = { 0 };//省略元素大小，数组必须初始化，数组的大小有初始化元素的个数决定


	return 0;
}
